{
  "id": "the-modern-attack-surface-how-computers-get-compromised",
  "slug": "the-modern-attack-surface-how-computers-get-compromised",
  "title": "The Modern Attack Surface: How Computers Get Compromised",
  "date": "2026-01-26T10:00:00.000Z",
  "cover": "/assets/images/blog/how-rag-works-cover.png",
  "excerpt": "An overview of how the attack surface has evolved in modern computing, and the ways computers and accounts get compromised today.",
  "html": "<h1>The Modern Attack Surface: How Computers Get Compromised</h1>\n<p>This post started with a simple question a friend asked me: which antivirus should I be using?</p>\n<p>It made me pause. Not because the question was wrong, but because it assumed an older model of how things go wrong. Before answering, I found myself asking a more basic question instead.</p>\n<p>How are machines even getting compromised these days?</p>\n<p>Once you really sit with that question, the antivirus conversation starts to feel secondary.</p>\n<p>Operating systems are more locked down than they have ever been. Automatic updates are normal. Sandboxing, permissions, and code signing actually work.</p>\n<p>And yet compromises are everywhere.</p>\n<p>The reason is simple. The attack surface moved. It is no longer centered on the computer itself. It is centered on identity, sessions, and everyday trust.</p>\n<h2>The old mental model most of us still have</h2>\n<p>For a long time, compromise looked straightforward. Something bad landed on your machine, the computer was infected, and the damage lived there.</p>\n<pre><code class=\"language-mermaid\">graph LR\nA[Attacker] --&gt; B[Virus or Malware] --&gt; C[Your Computer] --&gt; D[Damage]\n</code></pre>\n<p><img src=\"../../public/assets/images/blog/modern-attack-surface/attack-model-old.svg\" alt=\"alt text\"></p>\n<p>attack-model-old.svg</p>\n<p>That model made sense when systems were fragile and defenses were thin. If you avoided sketchy downloads, you were mostly safe.</p>\n<p>That world quietly disappeared.</p>\n<h2>What compromise usually looks like now</h2>\n<p>Today, the computer is often fine. The operating system is doing its job. Nothing looks obviously broken.</p>\n<p>What fails is access.</p>\n<pre><code class=\"language-mermaid\">graph LR\nA[Attacker] --&gt; B[Fake Login or Approval] --&gt; C[Account Access] --&gt; D[Everything Else]\n</code></pre>\n<p>Once someone controls an account, they rarely need to touch the device. Email access alone is enough to reset passwords, read private documents, send convincing messages, and stay invisible for a long time.</p>\n<p>This works the same way on Windows, macOS, and iOS. The platform matters far less than people think once trust is lost.</p>\n<h2>Why browsers quietly became the real operating system</h2>\n<p>Most of what matters now happens inside a browser. Email, documents, calendars, dashboards, payments, internal tools. That is where work lives and where trust accumulates.</p>\n<pre><code class=\"language-mermaid\">graph TD\nA[You] --&gt; B[Browser Session]\nB --&gt; C[Email]\nB --&gt; D[Documents]\nB --&gt; E[Calendars]\nB --&gt; F[Payments]\nB --&gt; G[Internal Tools]\nC --&gt; H[Actions and Data]\nD --&gt; H\nE --&gt; H\nF --&gt; H\nG --&gt; H\n</code></pre>\n<p>Modern attacks aim for that session, not the computer underneath it.</p>\n<p>A fake login page that looks familiar. A browser extension that seemed useful at the time. A stolen session token that never triggers a password prompt.</p>\n<p>Once the browser believes you are authenticated, the rest of the system follows along.</p>\n<h2>What this feels like as an end user</h2>\n<p>For most people, compromise does not feel technical. It feels confusing.</p>\n<p>You cannot log into an account you used yesterday. You see password reset emails you did not request. Calendar events appear that you never added. Messages are sent from your account that you did not write. A bank asks you to confirm activity you do not recognize.</p>\n<p>Nothing screams virus. It just feels like control slipping.</p>\n<p>That uncertainty is often the worst part. You stop trusting your own systems. You hesitate on legitimate prompts because everything suddenly looks suspicious.</p>\n<h2>Why this keeps cascading once it starts</h2>\n<p>Once one core account is compromised, others tend to follow quickly.</p>\n<pre><code class=\"language-mermaid\">graph TD\nA[Email Compromised] --&gt; B[Password Resets]\nA --&gt; C[Cloud Access]\nA --&gt; D[Contacts]\nB --&gt; E[Other Accounts Locked Out]\nC --&gt; F[Document Exposure]\nD --&gt; G[Social Trust Abuse]\nE --&gt; H[Multiple Accounts Involved]\nF --&gt; H\nG --&gt; H\nH --&gt; I[Time Consuming Cleanup]\n</code></pre>\n<p>By the time most people realize something is wrong, multiple accounts are already involved. Cleaning it up becomes time consuming, stressful, and disruptive.</p>\n<p>The damage is not always financial. Lost files, missed messages, and impersonation have real personal and professional consequences even when no money is stolen.</p>\n<h2>The attack vectors people rarely think about</h2>\n<p>Many real compromises come from places that feel routine.</p>\n<p>Calendar invites carry links and reminders that feel trusted. People accept them reflexively.</p>\n<p>OAuth and sign-in flows feel safer than passwords, so people approve access quickly. That access often survives password changes because it was never tied to the password in the first place.</p>\n<p>Browser extensions accumulate quietly. They update silently. Permissions stay broad. One compromised extension can observe sessions and modify pages without ever looking like malware.</p>\n<p>Recovery paths are often forgotten entirely. Backup email addresses, trusted devices, linked accounts. Attackers do not need to break the front door if the side door is unlocked.</p>\n<p>Shared devices create long-lived access in environments that no longer exist. Trust lingers long after context changes.</p>\n<p>None of this feels malicious in the moment. That is why it works.</p>\n<h2>Where AI makes this harder for normal people</h2>\n<p>AI did not invent new attacks. It removed friction.</p>\n<p>Messages are now fluent, contextual, and emotionally tuned. What used to stand out blends into everyday communication. Small mistakes become easier to make, not because people are careless, but because the signal is harder to distinguish from normal life.</p>\n<p>AI also enables adaptive interaction. Instead of a single scam message, attacks can unfold as conversations that respond naturally to hesitation or questions.</p>\n<p>At the same time, AI tools are becoming part of daily workflows. People paste sensitive information into them without much thought. They authorize access to be helpful or efficient. Each approval feels minor. Collectively, they widen the attack surface in ways most users never map explicitly.</p>\n<h2>Why platform choice alone no longer protects you</h2>\n<p>There is a comforting belief that choosing the right operating system solves most of this. Better defaults help, but they do not solve the core issue.</p>\n<pre><code class=\"language-mermaid\">graph TD\nA[Compromised Account] --&gt; B[Windows Laptop]\nA --&gt; C[macOS Laptop]\nA --&gt; D[iPhone]\nA --&gt; E[iPad]\nA --&gt; F[Work Computer]\nB --&gt; G[Identity Flows Across All Devices]\nC --&gt; G\nD --&gt; G\nE --&gt; G\nF --&gt; G\n</code></pre>\n<p>Identity flows across devices. Once access is compromised, it follows you everywhere.</p>\n<p>This is why people feel blindsided after doing everything right. Updates were installed. Sketchy downloads were avoided. None of that mattered once trust was reused upstream.</p>\n<h2>Work accounts versus personal accounts</h2>\n<p>Your work email operates under different rules.</p>\n<p>Your employer controls your work account. They can see what you&#39;re doing, enforce password changes, require two-factor authentication, and reset your access if needed. Your IT department will notice if someone is using it from a strange location or accessing unusual data. But you have less control over recovery if something goes wrong.</p>\n<p>Work account compromise is worse in different ways. An attacker gains access to your company&#39;s data, your coworkers, and potentially customer information. The problem spreads beyond you.</p>\n<p>Personal accounts are yours to protect or neglect. No one is watching. You control recovery, but you&#39;re also alone in defending it.</p>\n<p>Protect your work account like it matters to everyone else, because it does. Use the strongest authentication your employer allows. Don&#39;t reuse that password anywhere. Assume it&#39;s being monitored. If you suspect it&#39;s compromised, tell IT immediately.</p>\n<p>Your personal accounts matter more to you than anyone else will ever know. That responsibility is entirely yours.</p>\n<h2>So where does antivirus fit now</h2>\n<p>Antivirus still has a place. It helps catch known malicious software and obvious bad installers, especially on Windows.</p>\n<p>It just is not what usually saves people anymore.</p>\n<p>Most modern compromises do not involve infecting the machine at all. They involve inheriting access. Antivirus cannot stop you from logging into the wrong place or approving the wrong thing.</p>\n<p>It is a seatbelt, not the steering wheel.</p>\n<h2>Understanding data breaches</h2>\n<p>When you hear that a service you use suffered a data breach, it&#39;s worth understanding what that actually means.</p>\n<p>A breach means attackers got data that shouldn&#39;t be public. If it&#39;s a password, that password is now known. If it&#39;s your email and password together, that combination is in a list somewhere that gets shared and tested against other services.</p>\n<pre><code class=\"language-mermaid\">graph LR\nA[Breach at Service X] --&gt; B[Password Leaked]\nB --&gt; C{Same Password Used Elsewhere?}\nC --&gt;|Yes| D[Gmail Compromised]\nC --&gt;|Yes| E[Banking Compromised]\nC --&gt;|Yes| F[Work Email Compromised]\nC --&gt;|No| G[Safe - Different Passwords Used]\nD --&gt; H[Cascade of Compromises]\nE --&gt; H\nF --&gt; H\n</code></pre>\n<p>Check if you&#39;re in a known breach at haveibeenpwned.com. Enter your email and you&#39;ll see which services leaked your information. This is useful. Not panic-inducing. Just useful.</p>\n<p>A breach is past tense. Your password was leaked in 2018. That doesn&#39;t mean someone is using it now. But if you reused that password on other sites, those accounts are exposed.</p>\n<p>This is why password reuse is so dangerous. One old breach at some forgotten service becomes a key to your email, banking, or work accounts years later.</p>\n<p>The action is simple. If you were in a breach for a service that knows your password, change it. If you used the same password elsewhere, change those too. If the breached service offered two-factor authentication and you didn&#39;t use it, enable it now.</p>\n<p>Most people are in multiple breaches. You probably are too. That&#39;s normal. The breach that matters is the one you don&#39;t know about yet. The one where you kept the same password everywhere.</p>\n<h2>Spotting compromise before it spirals</h2>\n<p>There are early signals before the damage becomes obvious.</p>\n<p>Check your account activity periodically. Most email and cloud services show where you&#39;re signed in and recent login locations. An unfamiliar city or device in that list is a genuine warning sign.</p>\n<p>Recovery email or phone number changes are a red flag. If you suddenly can&#39;t use your backup email to reset a password, someone may have changed it. Same with linked phone numbers or authentication apps.</p>\n<p>Connected apps and permissions creep slowly. Services like Google and Microsoft show what third-party apps have access to your account. If you see apps you don&#39;t recognize, or apps with permissions you don&#39;t remember granting, revoke the access. It&#39;s usually one click.</p>\n<p>Two-factor authentication breaks the account takeover chain. If someone has your password but not your phone, they still can&#39;t get in. That friction is what stops most attacks.</p>\n<h2>Behaviors that expose you more than others realize</h2>\n<p>Reusing passwords across sites means one breach ripples everywhere. A breach at some obscure service leaks credentials that work on Gmail or your bank. Password managers let you use different passwords everywhere without memorizing them.</p>\n<p>Approving account access without reading what&#39;s being requested is risky. That app asking for &quot;calendar and email access&quot; might only need one of those. Read the request before clicking approve.</p>\n<p>Public WiFi creates a different problem than it used to. The WiFi itself isn&#39;t the issue. The issue is attackers intercepting login traffic. VPNs help, but real protection comes from password managers autofilling credentials and services using encryption. Don&#39;t manually type passwords on public WiFi.</p>\n<p>Clicking links in emails, even from people you know, is riskier now. Those emails can be impersonated or accounts can be compromised. If something seems unusual, go directly to the website instead of clicking the link. Especially with financial and account management emails.</p>\n<h2>Anti-patterns: What NOT to do</h2>\n<p>Some habits feel convenient but directly enable compromise.</p>\n<p>Do not share passwords with family members, even in emergencies. Once shared, you lose control. You can&#39;t change it without inconveniencing them. If they&#39;re compromised, so are you. If they leave or your relationship changes, you have a password you never reset. Use family plans or shared password vaults instead.</p>\n<p>Do not write passwords down and leave them accessible. A notebook on your desk, a sticky note in your wallet, or a note in your phone is worse than a password manager. No encryption. No backup. No way to update everywhere at once.</p>\n<p>Do not use the same password or PIN pattern across accounts. This is the core vulnerability that breaks everything. One breach becomes an attack on all your accounts.</p>\n<p>Do not disable security notifications or two-factor authentication because they&#39;re inconvenient. They&#39;re inconvenient by design. That inconvenience is what stops attackers.</p>\n<p>Do not ignore unusual activity emails from your accounts. Check them. If they&#39;re real, you need to know. If they&#39;re phishing, at least you&#39;re awake and can respond.</p>\n<p>Do not grant app permissions you don&#39;t understand. That app asking for &quot;calendar and email access&quot; can now see every conversation you&#39;ve had and every meeting you&#39;re attending. Read what&#39;s being requested. It should match what the app does.</p>\n<p>Do not type passwords on public WiFi. The WiFi isn&#39;t the vulnerability. The vulnerability is someone intercepting your login. Use a password manager so it autofills, or wait until you&#39;re home.</p>\n<p>Do not leave old accounts open and forgotten. An old email you don&#39;t use, an old social media account, a service you abandoned. These become recovery paths for attackers. Delete them or change their passwords if deletion isn&#39;t possible.</p>\n<h2>For families and less technical users</h2>\n<p>Shared accounts with family are riskier than they seem. A shared Netflix account is fine. A shared email or cloud account is a serious risk because anyone with access can reset other accounts.</p>\n<p>Children&#39;s accounts should be separate, even if they&#39;re young. An account a 10-year-old uses for school shouldn&#39;t be shared with the whole family.</p>\n<p>Elderly or less tech-savvy family members are often targeted specifically. Attackers know they&#39;re less likely to recognize phishing or social engineering. If a parent or grandparent is asking you to help verify their account, double-check the request actually came from that service.</p>\n<p>Support channels become attack vectors when attackers impersonate them. A call claiming to be from your bank asking you to verify information should be treated as suspicious. Legitimate support never asks for passwords.</p>\n<h2>Mobile-specific reality</h2>\n<p>The line between apps and accounts is blurrier on mobile. An app installed from your app store has permissions to see your location, contacts, photos, calendar, and more. If the app is compromised, that&#39;s a live connection to your personal information.</p>\n<p>Sign-in-with-Google or sign-in-with-Apple defaults are convenient but they also mean that Google or Apple now has another connection tracking what you&#39;re doing. More importantly, if someone compromises your account, they get access to every app you&#39;ve signed into that way.</p>\n<p>Android and iOS protect you in different ways, but both flow personal data through your account. The account is still the single point of failure.</p>\n<h2>What actually helps</h2>\n<pre><code>PRIORITY ACTIONS FOR ACCOUNT SECURITY\n═════════════════════════════════════════════════════\n\n✓ Two-factor authentication\n  Use it on email, cloud storage, and banking\n  Most effective defense against account takeover\n  \n✓ Password manager (Chrome or Apple Keychain)\n  Generate random passwords automatically\n  Never reuse passwords across sites\n  \n✓ Audit connected apps\n  Periodically check what has access to your account\n  Revoke anything suspicious\n  \n✓ Monitor account activity\n  Check unusual login locations and devices\n  Pay attention to reset emails you didn&#39;t request\n  \n✓ Backup authentication methods\n  Recovery email, phone number, recovery codes\n  Stored safely in case you get locked out\n  \n═════════════════════════════════════════════════════\nWhat doesn&#39;t help as much anymore: antivirus software,\navoiding downloads, keeping a clean system.\n\nThose still help, but they don&#39;t solve the modern problem.\n</code></pre>\n<h2>How to actually implement this</h2>\n<p>The biggest gap between understanding the problem and staying safe is actually doing something about it.</p>\n<p>Don&#39;t reuse passwords. Use the password manager built into your browser or phone. You already have it.</p>\n<p><strong>INSECURE vs. SECURE PASSWORD STORAGE</strong></p>\n<pre><code>❌ INSECURE - Do NOT do these:\n═════════════════════════════════════════════════\nEmail to yourself      → Unencrypted, accessible to anyone with email\nDesktop text file      → No encryption, visible to anyone with access\nNotebook at desk       → Physical security issue, can be photographed\nSpreadsheet            → Centralized, unencrypted, ripple effect if stolen\nSame password reused   → One breach = all accounts compromised\nPhone photo of note    → Backed up to cloud, searchable\n\n\n✓ SECURE - Do these:\n═════════════════════════════════════════════════\nChrome Password Manager    → Encrypted, syncs across devices, autofills\nApple Keychain            → Encrypted, syncs across Apple devices\nGenerated random password → Let the manager create it, never memorize\nDifferent password per site → One breach doesn&#39;t cascade to other accounts\nAuto-fill enabled         → Never type password manually, especially on WiFi\n</code></pre>\n<p>If you use Chrome or Android, use the password manager that comes with it. If you use Apple devices, use Keychain. Both work everywhere. Both are encrypted. Both sync across your devices. You don&#39;t need anything else.</p>\n<p>When you create a password on a website, let the password manager generate a random one. Don&#39;t come up with it yourself. Don&#39;t try to make it memorable. The whole point is that you never have to remember it or type it. The password manager fills it in.</p>\n<p>The temptation is to reuse a password you already know because it feels simpler. It&#39;s not. It&#39;s the opposite. One breach leaks that password everywhere.</p>\n<p>Never email yourself a password. Never write it in a note on your desktop or phone. Never keep a spreadsheet of passwords. These are worse than reusing the same password because they&#39;re unencrypted and centralized.</p>\n<p>For critical documents, use a combination of physical and digital storage.</p>\n<p><strong>CRITICAL DOCUMENTS STORAGE STRATEGY</strong></p>\n<pre><code>ORIGINAL DOCUMENTS (Physical)\n═════════════════════════════════════════════════\n  Birth Certificate\n  Passport\n  Property Deeds\n  Insurance Policies\n  \n  ↓ STORE IN ↓\n  \n  □ Safe deposit box at bank\n  □ Personal safe at home (fireproof)\n  □ NOT on desk, NOT easily accessible\n\n\nDIGITAL COPIES (Encrypted Cloud)\n═════════════════════════════════════════════════\n  Scan originals or take photos\n  Store in encrypted cloud storage:\n  \n  ✓ Google Drive (with 2FA enabled)\n  ✓ Microsoft OneDrive (with 2FA enabled)\n  ✓ iCloud (with 2FA enabled)\n  \n  Enable two-factor authentication on the account\n  Access from anywhere, backed up automatically\n\n\nRECOVERY CODES (Physical Backup)\n═════════════════════════════════════════════════\n  Print recovery codes from 2FA setup\n  Write them down (if preferred)\n  \n  ✓ Store in safe or safe deposit box\n  ✗ NOT in desk drawer\n  ✗ NOT as phone photo\n  ✗ NOT unencrypted notes\n\n\n═════════════════════════════════════════════════\nPATTERN: Don&#39;t rely on single location\n         Don&#39;t sacrifice security for access\n         Multi-layer physical + digital backup\n</code></pre>\n<p>Critical documents: birth certificates, passports, insurance policies, property deeds, medical records, financial statements. Keep the originals in a physical safe or safe deposit box. Scan them or take photos and store the digital copies in cloud storage like Google Drive, Microsoft OneDrive, or iCloud with two-factor authentication enabled on that account.</p>\n<p>Don&#39;t keep important documents on your desktop or in random folders. Don&#39;t email them to yourself as attachments. Don&#39;t store them on a USB drive left in a drawer.</p>\n<p>For recovery codes from two-factor authentication, print them out or write them down and store the physical copy in a safe place. A safe or safe deposit box. Not in a desk drawer. Not a photo on your phone.</p>\n<p>The pattern is the same: don&#39;t rely on a single location. Don&#39;t trust convenience over security. Don&#39;t store sensitive information in places that feel easy to access but aren&#39;t actually protected.</p>\n<h2>If you realize you&#39;re compromised</h2>\n<p>Act fast. The first 24 hours matter.</p>\n<pre><code class=\"language-mermaid\">graph TD\nA[Realize Compromise] --&gt; B[&quot;HOUR 1: Change Email Password&lt;br/&gt;from clean device&quot;]\nB --&gt; C[&quot;Sign out all sessions&lt;br/&gt;everywhere&quot;]\nC --&gt; D[&quot;Check devices connected&lt;br/&gt;to account&quot;]\nD --&gt; E[&quot;Verify recovery methods&lt;br/&gt;haven&#39;t changed&quot;]\nE --&gt; F[&quot;Audit connected apps&lt;br/&gt;revoke suspicious ones&quot;]\nF --&gt; G{Email Access&lt;br/&gt;Compromised?}\nG --&gt;|Yes| H[&quot;Change passwords&lt;br/&gt;on financial accounts&quot;]\nG --&gt;|Yes| I[&quot;Change passwords&lt;br/&gt;on healthcare accounts&quot;]\nH --&gt; J{Financial&lt;br/&gt;Accounts?}\nI --&gt; J\nJ --&gt;|Yes| K[&quot;Consider credit freeze&lt;br/&gt;Stop new accounts opening&quot;]\nJ --&gt;|No| L[&quot;Damage Control Complete&lt;br/&gt;Monitor for weeks&quot;]\nK --&gt; L\n</code></pre>\n<p><strong>Step by step:</strong></p>\n<ol>\n<li><p>Change your email password immediately from a clean device (computer you know hasn&#39;t been compromised). Email is your master key.</p>\n</li>\n<li><p>Sign out all sessions. Most email and cloud services have an option to sign out everywhere at once.</p>\n</li>\n<li><p>Check what devices are signed in and revoke any you don&#39;t recognize.</p>\n</li>\n<li><p>Verify your phone number and recovery options haven&#39;t been changed. If they have, compromise is more serious.</p>\n</li>\n<li><p>Check what apps have connected to your account and revoke access to anything suspicious.</p>\n</li>\n<li><p>If your email was compromised, assume other accounts with similar passwords are at risk. Change passwords on financial accounts, healthcare, and anything important.</p>\n</li>\n<li><p>Consider freezing credit if financial accounts are involved. This stops attackers from opening accounts in your name.</p>\n</li>\n</ol>\n<h2>The real shift to internalize</h2>\n<p>Modern compromise is rarely about broken software. It is about normal behavior becoming predictable.</p>\n<p>Logging in. Approving access. Staying signed in. Reusing trust across contexts.</p>\n<p>These are not technical actions. They are everyday habits. That is why they are so easy to exploit.</p>\n<h2>Closing thought</h2>\n<p>If modern compromise feels unfair, it is because the rules changed quietly.</p>\n<p>Your computer did not suddenly become unsafe. The way trust moves through your digital life did.</p>\n<p>Once you start thinking in terms of identity, sessions, and approvals, these incidents stop feeling mysterious. They start feeling structural.</p>\n<p>Not because systems are weak, but because trust is easier to steal than code is to break.</p>\n<hr>\n<h2>Visual Assets (Placeholders for images)</h2>\n<p>The following sections could benefit from custom designed images/icons:</p>\n<ul>\n<li><p><strong>[IMAGE PLACEHOLDER 1]</strong> - Illustration of old attack model (virus → computer → damage) vs new model (fake login → account → everything)</p>\n</li>\n<li><p><strong>[IMAGE PLACEHOLDER 2]</strong> - Icon set showing the five key protections (2FA, password manager, app audit, activity monitoring, recovery methods)</p>\n</li>\n<li><p><strong>[IMAGE PLACEHOLDER 3]</strong> - Visual comparison of password storage methods (email vs. notes vs. password manager)</p>\n</li>\n<li><p><strong>[IMAGE PLACEHOLDER 4]</strong> - Timeline or infographic showing compromise cascade (email → passwords → cloud → contacts)</p>\n</li>\n<li><p><strong>[IMAGE PLACEHOLDER 5]</strong> - Device ecosystem diagram showing how one compromised account affects all devices</p>\n</li>\n<li><p><strong>[IMAGE PLACEHOLDER 6]</strong> - Safe/security imagery for document storage strategy</p>\n</li>\n</ul>\n",
  "url": "https://nick.karnik.io/blog/the-modern-attack-surface-how-computers-get-compromised",
  "tags": [
    "Security",
    "Attack Surface",
    "Cybersecurity",
    "Threats",
    "Virus"
  ]
}